import requests
import json
import pandas as pd
import openpyxl
import copy


startStatnNm = str(input("지하철역명 : "))
lastStatnNm = str(input("도착 지하철역명 : "))

# 엑셀 파일 명
file_name = 'stationList.xlsx'

# 엑셀 파일 읽기
data_list = pd.read_excel(file_name, sheet_name='stationTime', usecols=[0, 1, 2, 3])

# 읽은 엑셀 파일을 데이터 프레임화
df_list = pd.DataFrame(data_list)

# 데이터프레임을 딕셔너리로 변환
station_dict = df_list.set_index('STATN_ID')['STATN_NM'].to_dict()

stationNode = {}
used_stationId = []

stationNode = {}

# 노드 추가 함수
def add_node(station_a, station_b, distance):
    inner_station = stationNode.get(station_a, {})
    inner_station[station_b] = distance
    stationNode[station_a] = inner_station
    
    inner_station = stationNode.get(station_b, {})
    inner_station[station_a] = distance
    stationNode[station_b] = inner_station


for station_list in range(len(station_dict)):
    # api 호출
    current_url = 'http://swopenAPI.seoul.go.kr/api/subway/4e50657a6d6c797537394443537774/json/realtimeStationArrival/0/100/{}'.format(df_list["STATN_NM"][station_list])
    # 내용 파싱
    get_url = requests.get(current_url)
    # 읽을 수 있게 json화
    current_json_data = json.loads(get_url.text)

    if ("errorMessage" in current_json_data):
        for i in range(0, int(current_json_data["errorMessage"]["total"])):
            # df_list의 현재 id와 json_data의 현재 id가 같고 upnLine이 상행이고 현재 역 id와 다음 역 id가 같지 않고 used_stationId에 현재 역 id가 없다면
            if (int(df_list["STATN_ID"][station_list]) == int(current_json_data["realtimeArrivalList"][i]["statnId"]) and str(current_json_data["realtimeArrivalList"][i]["updnLine"]) == "상행" and int(df_list["STATN_ID"][station_list]) != int(current_json_data["realtimeArrivalList"][i]["statnTid"]) and int(df_list["STATN_ID"][station_list]) not in used_stationId):
                # 쓸데없는 반복 탐색 방지
                used_stationId.append(int(df_list["STATN_ID"][station_list]))
                # 다음 역 id를 다음 역 이름으로 변환
                statn_Tnm = station_dict[int(current_json_data["realtimeArrivalList"][i]["statnTid"])]
                # 역간 거리
                station_dis = "{}".format(df_list["DISTANCE"][station_list])
                
                # 노드 추가
                add_node(statn_Tnm, df_list["STATN_NM"][station_list], station_dis)
                add_node(df_list["STATN_NM"][station_list], statn_Tnm, station_dis)

            else:
                pass
    else:
        print("{} : {}".format(current_json_data["message"], df_list["STATN_NM"][station_list]))


print(stationNode)


######## 여기 이하는 https://phaphaya.tistory.com/34 의 코드 사용 (설명은 이 사이트에서)
print ("-----------[", startStatnNm, "->", lastStatnNm,"]----------")

routing = {}
for place in stationNode.keys():
    routing[place]={'shortestDist':0, 'route':[], 'visited':0}

def visitPlace(visit):
    routing[visit]['visited'] = 1
    for toGo, betweenDist in stationNode[visit].items():
        toDist = routing[visit]['shortestDist'] + betweenDist
        if (routing[toGo]['shortestDist'] >= toDist) or  not routing[toGo]['route']:
            routing[toGo]['shortestDist'] = toDist
            routing[toGo]['route'] = copy.deepcopy(routing[visit]['route'])
            routing[toGo]['route'].append(visit)

visitPlace(startStatnNm)

while 1 :

    minDist = max(routing.values(), key=lambda x:x['shortestDist'])['shortestDist']
    toVisit = ''
    for name, search in routing.items():
        if 0 < search['shortestDist'] <= minDist and not search['visited']:
            minDist = search['shortestDist']
            toVisit = name

    if toVisit == '':
        break

    visitPlace(toVisit)

    print ("["+toVisit+"]")
    print ("Dist :", minDist)

print ("\n", "[", startStatnNm, "->", lastStatnNm,"]")
print ("Route : ", routing[lastStatnNm]['route'])
print ("ShortestDistance : ", routing[lastStatnNm]['shortestDist'])
########

stationNode = {'소요산': {'동두천': '1.6'}, '동두천': {'소요산': '1.6', '보산': '1.4'}, '보산': {'동두천': '1.4', '동두천중앙': '1.0'}, '동두천중앙': {'보산': '1.0', '지행': '5.6'}, '지행': {'동두천중앙': '5.6', '덕정': '2.9'}, '덕정': {'지행': '2.9', '덕계': '5.3'}, '덕계': {'덕정': '5.3', '양주': '1.6'}, '양주': {'덕계': '1.6', '녹양': '1.3'}, '녹양': {'양주': '1.3', '가능': '1.2'}, '가능': {'녹양': '1.2', '의정부': '1.6'}, '의정부': {'가능': '1.6', '회룡': '1.4'}, '회룡': {'의정부': '1.4', '망월사': '2.3'}, '망월사': {'회룡': '2.3', '도봉산': '1.2'}, '도봉산': {'망월사': '1.2', '도봉': '1.3', '장암': '1.4', '수락산': '1.6'}, '도봉': {'도봉산': '1.3', '방학': '1.7'}, '방학': {'도봉': '1.7', '창동': '1.0'}, '창동': {'방학': '1.0', '녹천': '1.4', '노원': '1.4', '쌍문': '1.3'}, '녹천': {'창동': '1.4', '월계': '1.1'}, '월계': {'녹천': '1.1', '광운대': '1.1'}, '광운대': {'월계': '1.1', '석계': '1.4'}, '석계': {'광운대': '1.4', '신이문': '0.8', '돌곶이': '1.0', '태릉입구': '0.8'}, '신이문': {'석계': '0.8', '외대앞': '0.8'}, '외대앞': {'신이문': '0.8', '회기': '1.4'}, '회기': {'외대앞': '1.4', '청량리': '-1.0', '중랑': '-1.0'}, '청량리': {'회기': '-1.0', '제기동': '1.0', '왕십리': '-1.0'}, '제기동': {'청량리': '1.0', '신설동': '0.9'}, '신설동': {'제기동': '0.9', '동묘앞': '0.7', '보문': '1.0'}, '동묘앞': {'신설동': '0.7', '동대문': '0.6', '신당': '0.6', '창신': '0.9'}, '동대문': {'동묘앞': '0.6', '종로5가': '0.8', '혜화': '1.5', '동대문역사문화공원': '0.7'}, '종로5가': {'동대문': '0.8', '종로3가': '0.9'}, '종로3가': {'종로5가': '0.9', '종각': '0.8', '안국': '1.0', ' 을지로3가': '0.6', '광화문': '1.2', '을지로4가': '1.0'}, '종각': {'종로3가': '0.8', '시청': '1.0'}, '시청': {'종각': '1.0', '서울': '1.1'}, '서울': {'시청': '1.1', '남영': '1.7', '회현': '0.9', '숙대입구': '1.0', '신촌(경의중앙선)': '0.0', '공덕': '3.3'}, '남영': {'서울': '1.7', '용산': '1.5'}, '용산': {'남영': '1.5', '노량진': '1.8', '효창공원앞': '-1.0', '이촌': '1.9'}, '노량진': {'용산': '1.8', '대방': '1.5', '샛강': '1.2', '노들': '1.1'}, '대방': {'노량진': '1.5', '신길': '0.8'}, '신길': {'대방': '0.8', '영등포': '1.0', '영등포시장': '1.1', '여의도': '1.0'}, '영등포': {'신길': '1.0', '신도림': '1.5'}, '신도림': {'영등포': '1.5', '구로': '1.1'}, '구로': {'신도림': '1.1', '구일': '1.4', '가산디지털단지': '1.1'}, '구일': {'구로': '1.4', '개봉': '1.0'}, '개봉': {'구일': '1.0', '오류동': '1.3'}, '오류동': {'개봉': '1.3', '온수': '1.9'}, '온수': {'오류동': '1.9', '역곡': '1.3', '천왕': '1.5', '까치울': '2.2'}, '역곡': {'온수': '1.3', '소사': '1.5'}, '소사': {'역곡': '1.5', '부천': '1.1', '부천종합운동장': '2.7', '소새울': '1.7'}, '부천': {'소사': '1.1', '중동': '1.7'}, '중동': {'부천': '1.7', '송내': '1.0'}, '송내': {'중동': '1.0', '부개': '1.2'}, '부개': {'송내': '1.2', '부평': '1.5'}, '부평': {'부개': '1.5', '백운': '1.7'}, '백운': {'부평': '1.7', '동암': '1.5'}, '동암': {'백운': '1.5', '간석': '1.2'}, '간석': {'동암': '1.2', ' 주안': '1.2'}, '주안': {'간석': '1.2', '도화': '1.0'}, '도화': {'주안': '1.0', '제물포': '1.0'}, '제물포': {'도화': '1.0', '도원': '1.4'}, '도원': {'제물포': '1.4', '동인천': '1.2'}, '동인천': {'도원': '1.2', '인천': '1.9'}, 
'인천': {'동인천': '1.9', '신포': '1.0'}, '가산디지털단지': {'구로': '1.1', '독산': '2.0', '남구로': '0.8', '철산': '1.4'}, '독산': {'가산디지털단지': '2.0', '금천구청': '1.2'}, '금천구청': {'독산': '1.2', '석수': '1.9'}, '석수': {'금천구청': '1.9', '관악': '1.9'}, '관악': {'석수': '1.9', '안양': '2.4'}, '안양': {'관악': '2.4', '명학': '2.2'}, '명학': {'안양': '2.2', '금정': '1.4'}, '금정': {'명학': '1.4', '군포': '2.2', '범계': '2.6', '산본': '2.3'}, '군포': {'금정': '2.2', '당정': '1.6'}, '당정': {'군포': '1.6', '의왕': '2.6'}, '의왕': {'당정': '2.6', '성균관대': '2.9'}, '성균관대': {'의왕': '2.9', '화서': '2.6'}, '화서': {'성균관대': '2.6', '수원': '2.1'}, '수원': {'화서': '2.1', '세류': '2.9', '매교': '1.5', '고색': '2.7'}, '세류': {'수원': '2.9', '병점': '4.3'}, '병점': {'세류': '4.3', '세마': '2.4'}, '세마': {'병점': '2.4', '오산대': '2.7'}, '오산대': {'세마': '2.7', '오산': '2.7'}, '오산': {'오산대': '2.7', '진위': '4.0'}, '진위': {'오산': '4.0', '송탄': '3.8'}, '송탄': {'진위': '3.8', '서정리': '2.2'}, '서정리': {'송탄': '2.2', '지제': '4.8'}, '지제': {'서정리': '4.8', '평택': '3.7'}, '평택': {'지제': '3.7', '성환': '9.4'}, '성환': {'평택': '9.4', '직산': '5.4'}, '직산': {'성환': '5.4', '두정': '5.4'}, '두정': {'직산': '5.4', '천안': '3.0'}, '천안': {'두정': '3.0', '봉명': '1.3'}, '봉명': {'천안': '1.3', '쌍용(나사렛대)': '1.6'}, '쌍용(나사렛대)': {'봉명': '1.6', '아산': '1.6'}, '아산': {'쌍용(나사렛대)': '1.6', '탕정': '1.8'}, '탕정': {'아산': '1.8', '배방': '3.1'}, '배방': {'탕정': '3.1', '온양온천': '4.9'}, '온양온천': {'배방': '4.9', '신창': '5.1'}, '신창': {'온양온천': '5.1'}, '대화': {'주엽': '1.6'}, '주엽': {'대화': '1.6', '정발산': '0.9'}, '정발산': {'주엽': '0.9', '마두': '1.4'}, '마두': {'정발산': '1.4', '백석': '2.5'}, '백석': {'마두': '2.5', '대곡': 
'2.1'}, '대곡': {'백석': '2.1', '화정': '2.6', '능곡': '1.8', '곡산': '1.8'}, '화정': {'대곡': '2.6', '원당': '2.9'}, '원당': {'화정': '2.9', '원흥': '2.1'}, '원흥': {'원당': '2.1', '삼송': '1.7'}, '삼송': {'원흥': '1.7', '지축': '0.0'}, '지축': {'삼송': '0.0', '구파발': '1.5'}, '구파발': {'지축': '1.5', '연신내': '2.0'}, '연신내': {'구파발': '2.0', '불광': '1.3'}, '불광': {'연신내': '1.3', '녹번': '1.1'}, '녹번': {'불광': '1.1', '홍제': '1.6'}, 
'홍제': {'녹번': '1.6', '무악재': '0.9'}, '무악재': {'홍제': '0.9', '독립문': '1.1'}, '독립문': {'무악재': '1.1', '경복궁': '1.6'}, '경복궁': {'독립문': '1.6', '안국': '1.1'}, '안국': {'경복궁': '1.1', '종로3가': '1.0'}, '을 지로3가': {'종로3가': '0.6', '충무로': '0.7'}, '충무로': {'을지로3가': '0.7', '동대입구': '0.9', '동대문역사문화공원': '1.3', '명동': '0.7'}, '동대입구': {'충무로': '0.9', '약수': '0.7'}, '약수': {'동대입구': '0.7', '금호': '0.8', '버티고개': '0.7', '청구': '0.8'}, '금호': {'약수': '0.8', '옥수': '0.8'}, '옥수': {'금호': '0.8', '압구정': '2.1', '한남': '1.6', '응봉': '1.8'}, '압구정': {'옥수': '2.1', '신사': '1.5'}, '신사': {'압구정': '1.5', '잠 원': '0.9', '논현': '0.7'}, '잠원': {'신사': '0.9', '고속터미널': '1.2'}, '고속터미널': {'잠원': '1.2', '교대': '1.6', '반포': '0.9', '내방': '2.2', '신반포': '0.8', '사평': '1.1'}, '교대': {'고속터미널': '1.6', '남부터미널': '0.9'}, '남부터미널': {'교대': '0.9', '양재': '1.8'}, '양재': {'남부터미널': '1.8', '매봉': '1.2', '강남': '1.5', '양재시민의숲': '1.6'}, '매봉': {'양재': '1.2', '도곡': '0.9'}, '도곡': {'매봉': '0.9', '대치': '0.8', '한티': '0.7', '구룡': '0.6'}, '대치': {'도곡': '0.8', '학여울': '0.8'}, '학여울': {'대치': '0.8', '대청': '0.9'}, '대청': {'학여울': '0.9', '일원': '1.1'}, '일원': {'대청': '1.1', '수서': '1.8'}, '수서': {'일원': '1.8', '가락시장': '1.4', '대모산입구': '3.2', '복정': '3.2'}, '가락시장': {'수서': '1.4', '경찰병원': '0.8', '송파': '0.8', '문정': '0.9'}, '경찰병원': {'가락시장': '0.8', '오금': '0.8'}, '오금': {'경찰병원': '0.8', '방이': '0.9', '개롱': '0.9'}, '당고개': {'상계': '1.2'}, '상계': {'당고개': '1.2', '노원': '1.0'}, '노원': {'상계': '1.0', '창동': '1.4', '마들': '1.2', '중계': '1.1'}, '쌍문': {'창동': '1.3', '수유': '1.5'}, '수유': {'쌍문': '1.5', '미아': '1.4'}, '미아': {'수유': '1.4', '미아사거리': '1.5'}, '미아사거리': {'미아': '1.5', '길음': '1.3'}, '길음': {'미아사거리': '1.3', '성신여대입구': '2.4'}, '성신여대입구': {'길음': '2.4', '한성대입구': '1.0', '정릉': '1.2', '보문': '0.9'}, '한성대입구': {'성신여대입구': '1.0', '혜화': '0.9'}, '혜화': {'한성대입구': '0.9', '동대문': '1.5'}, '동대문역사문화공원': {'동대문': '0.7', '충무로': '1.3', '을지로4가': '0.9', '청구': '0.9'}, '명동': {'충무로': '0.7', 
'회현': '0.7'}, '회현': {'명동': '0.7', '서울': '0.9'}, '숙대입구': {'서울': '1.0', '삼각지': '1.2'}, '삼각지': {'숙대입구': '1.2', '신용산': '0.7', '효창공원앞': '1.2', '녹사평': '1.1'}, '신용산': {'삼각지': '0.7', '이촌': '1.3'}, '이촌': {'신용산': '1.3', '동작': '2.7', '용산': '1.9', '서빙고': '-1.0'}, '동작': {'이촌': '2.7', '총신대입구(이수)': '1.8', '흑석': '1.4', '구반포': '1.0'}, '총신대입구(이수)': {'동작': '1.8', '사당': '1.1', '내방': 
'1.0', '남성': '1.0'}, '사당': {'총신대입구(이수)': '1.1', '남태령': '1.6'}, '남태령': {'사당': '1.6', '선바위': '0.9'}, '선바위': {'남태령': '0.9', '경마공원': '0.9'}, '경마공원': {'선바위': '0.9', '대공원': '1.0'}, '대공원': {'경마공원': '1.0', '과천': '1.0'}, '과천': {'대공원': '1.0', '정부과천청사': '3.0'}, '정부과천청사': {'과천': '3.0', '인덕원': '3.0'}, '인덕원': {'정부과천청사': '3.0', '평촌': '1.6'}, '평촌': {'인덕원': '1.6', '범계': '2.6'}, '범계': {'평촌': '2.6', '금정': '2.6'}, '산본': {'금정': '2.3', '수리산': '1.1'}, '수리산': {'산본': '1.1', '대야미': '2.6'}, '대야미': {'수리산': '2.6', '반월': '2.0'}, '반월': {'대야미': '2.0', '상록수': '3.7'}, '상록 수': {'반월': '3.7', '한대앞': '1.6'}, '한대앞': {'상록수': '1.6', '중앙': '1.6', '사리': '-1.0'}, '중앙': {'한대앞': '1.6', '고잔': '-1.0'}, '고잔': {'중앙': '-1.0', '초지': '-1.0'}, '초지': {'고잔': '-1.0', '안산': '1.8', '선부': '1.7', '시우': '1.4'}, '안산': {'초지': '1.8', '신길온천': '-1.0'}, '신길온천': {'안산': '-1.0', '정왕': '-1.0'}, '정왕': {'신길온천': '-1.0', '오이도': '-1.0'}, '오이도': {'정왕': '-1.0', '달월': '2.1'}, '방화': {'개화산': '0.9'}, '개화산': {'방화': '0.9', '김포공항': '1.2'}, '김포공항': {'개화산': '1.2', '송정': '1.2', '개화': '3.6', '공항시장': '0.8', '마곡나루': '2.3', '계양': '6.6', '능곡': '7.4', '원종': '4.3'}, '송정': {'김포공항': '1.2', '마곡': '1.1'}, '마곡': {'송정': '1.1', '발산': '1.2'}, '발산': {'마곡': '1.2', '우장산': '1.1'}, '우장산': {'발산': '1.1', '화곡': '1.0'}, '화곡': {'우장산': '1.0', '까치산': '1.2'}, '까치산': {'화곡': '1.2', '신정( 은행정)': '1.3'}, '신정(은행정)': {'까치산': '1.3', '목동': '0.8'}, '목동': {'신정(은행정)': '0.8', '오목교(목동운동장앞)': '0.9'}, '오목교(목동운동장앞)': {'목동': '0.9', '양평': '1.0'}, '양평': {'오목교(목동운동장앞)': '1.0', '영등포구청': '0.8', '오빈': '2.2', '원덕': '5.8'}, '영등포구청': {'양평': '0.8', '영등포시장': '0.9'}, '영등포시장': {'영등포구청': '0.9', '신길': '1.1'}, '여의도': {'신길': '1.0', '여의나루': '1.0', '국회의사당': '0.9', 
'샛강': '0.8'}, '여의나루': {'여의도': '1.0', '마포': '1.8'}, '마포': {'여의나루': '1.8', '공덕': '0.8'}, '공덕': {'마포': '0.8', '애오개': '1.1', '대흥(서강대앞)': '0.9', '효창공원앞': '1.5', '서강대': '1.0', '서울': '3.3', 
'홍대입구': '2.8'}, '애오개': {'공덕': '1.1', '충정로': '0.9'}, '충정로': {'애오개': '0.9', '서대문': '0.7'}, '서대문': {'충정로': '0.7', '광화문': '1.1'}, '광화문': {'서대문': '1.1', '종로3가': '1.2'}, '을지로4가': {'종로3가': '1.0', '동대문역사문화공원': '0.9'}, '청구': {'동대문역사문화공원': '0.9', '신금호': '0.9', '약수': '0.8', '신당': '0.7'}, '신금호': {'청구': '0.9', '행당': '0.9'}, '행당': {'신금호': '0.9', '왕십리': '0.9'}, '왕십리': {' 행당': '0.9', '마장': '0.7', '응봉': '1.4', '청량리': '-1.0', '서울숲': '2.2'}, '마장': {'왕십리': '0.7', '답십리': '1.0'}, '답십리': {'마장': '1.0', '장한평': '1.2'}, '장한평': {'답십리': '1.2', '군자(능동)': '1.5'}, '군자( 능동)': {'장한평': '1.5', '아차산(어린이대공원후문)': '1.0', '중곡': '1.1', '어린이대공원(세종대)': '1.1'}, '아차산(어린이대공원후문)': {'군자(능동)': '1.0', '광나루(장신대)': '1.5'}, '광나루(장신대)': {'아차산(어린이대공원후문)': '1.5', '천호(풍납토성)': '2.0'}, '천호(풍납토성)': {'광나루(장신대)': '2.0', '강동': '0.8', '암사': '1.3', '강동구청': '0.9'}, '강동': {'천호(풍납토성)': '0.8', '길동': '0.9', '둔촌동': '1.2'}, '길동': {'강동': '0.9', '굽은다리(강동구민회관앞)': '0.8'}, '굽은다리(강동구민회관앞)': {'길동': '0.8', '명일': '0.8'}, '명일': {'굽은다리(강동구민회관앞)': '0.8', '고덕': '1.2'}, '고덕': {'명일': '1.2', '상일동': '1.1'}, '상일동': {'고덕': '1.1'}, '둔촌동': {'강동': '1.2', '올림픽공원(한국체대)': '1.4'}, '올림픽공원(한국체대)': {'둔촌동': '1.4', '방이': '0.8', '둔촌오륜': '1.0'}, '방이': {'올림픽공원(한국체대)': '0.8', '오금': '0.9'}, '개롱': {'오금': '0.9', '거여': '0.9'}, '거여': {'개롱': '0.9', '마천': '0.9'}, '마천': {'거여': '0.9'}, '응암순환(상선)': {'새절(신사)': '0.9'}, '새절(신사)': {'응암순환(상선)': '0.9', '증산(명지대앞)': '0.9'}, '증산(명지대앞)': {'새절(신사)': '0.9', '디지털 미디어시티': '1.1'}, '디지털미디어시티': {'증산(명지대앞)': '1.1', '월드컵경기장(성산)': '0.8', '가좌': '1.7', '수색': '1.7', '홍대입구': '3.4', '마곡나루': '8.6'}, '월드컵경기장(성산)': {'디지털미디어시티': '0.8', '마포구청': '0.8'}, '마포구청': {'월드컵경기장(성산)': '0.8', '망원': '1.0'}, '망원': {'마포구청': '1.0', '합정': '0.8'}, '합정': {'망원': '0.8', '상수': '0.8'}, '상수': {'합정': '0.8', '광흥창': '0.9'}, '광흥창': {'상수': '0.9', '대흥(서강대앞)': 1}}

